Revit 2027 API
ExportPatternTable.Remove Method
 Removes the pair (key, info) by pattern key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ExportPatternKey exportPatternKey
)
Public Sub Remove (
	exportPatternKey As ExportPatternKey
)
public:
void Remove(
	ExportPatternKey^ exportPatternKey
)
member Remove :
        exportPatternKey : ExportPatternKey -> unit
Parameters
exportPatternKey ExportPatternKey
 The export pattern key.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace